#+TITLE: December 22, 2018 - January 6, 2018 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2018-12-22 Sat>
  :wpd-bhavin192: 1.25
  :wpd-nightwarrior-xxx: 1
  :wpd-sandeepK:      1
  :wpd-sidntrivedi: 1
  :END:
** bhavin192
*** Learning Golang
**** IN_PROGRESS Chapter 8. Goroutines and Channels [2/4]
     :PROPERTIES:
     :ESTIMATED: 1.75
     :ACTUAL:   0.70
     :OWNER:    bhavin192
     :ID:       READ.1545719105
     :TASKID:   READ.1545719105
     :END:
     :LOGBOOK:
     CLOCK: [2018-12-26 Wed 22:46]--[2018-12-26 Wed 23:06] =>  0:20
     CLOCK: [2018-12-26 Wed 21:42]--[2018-12-26 Wed 21:50] =>  0:08
     CLOCK: [2018-12-26 Wed 19:51]--[2018-12-26 Wed 20:05] =>  0:14
     :END:
     - [X] 8.7  Multiplexing with select (20m)
     - [X] 8.8  Example: Concurrent Directory Traversal (40m)
     - [ ] 8.9  Cancellation (25m)
     - [ ] 8.10 Example: Chat Server (20m)
**** IN_PROGRESS Chapter 8 Exercises [2/5]
     :PROPERTIES:
     :ESTIMATED: 7
     :ACTUAL:   2.32
     :OWNER:    bhavin192
     :ID:       DEV.1545719190
     :TASKID:   DEV.1545719190
     :END:
     :LOGBOOK:
     CLOCK: [2018-12-26 Wed 21:53]--[2018-12-26 Wed 22:21] =>  0:28
     CLOCK: [2018-12-25 Tue 22:54]--[2018-12-25 Tue 23:11] =>  0:17
     CLOCK: [2018-12-25 Tue 20:26]--[2018-12-25 Tue 20:48] =>  0:22
     CLOCK: [2018-12-25 Tue 17:28]--[2018-12-25 Tue 18:40] =>  1:12
     :END:
     - [X] 8.6  (1.5h)
     - [X] 8.7  (30m)
     - [ ] 8.8  (45m)
     - [ ] 8.9  (1.25h)
     - [ ] 8.10 (3h)
**** Chapter 9. Concurrency with Shared Variables [0/8]
     :PROPERTIES:
     :ESTIMATED: 3.5
     :ACTUAL:
     :OWNER:    bhavin192
     :ID:       READ.1545719340
     :TASKID:   READ.1545719340
     :END:
     - [ ] 9.1 Race Conditions (45m)
     - [ ] 9.2 Mutual Exclusion: sync.Mutex (25m)
     - [ ] 9.3 Read/Write Mutexes: sync.RWMutex (10m)
     - [ ] 9.4 Memory Synchronization (10m)
     - [ ] 9.5 Lazy Initialization: sync.Once (20m)
     - [ ] 9.6 The Race Detector (5m)
     - [ ] 9.7 Example: Concurrent Non-Blocking Cache (50m)
     - [ ] 9.8 Goroutines and Threads (40m)
**** Chapter 9 Exercises [0/4]
     :PROPERTIES:
     :ESTIMATED: 2
     :ACTUAL:
     :OWNER:    bhavin192
     :ID:       DEV.1545719399
     :TASKID:   DEV.1545719399
     :END:
     - [ ] 9.1 Exercises (30m)
     - [ ] 9.5 Exercises (35m)
     - [ ] 9.7 Exercises (20m)
     - [ ] 9.8 Exercises (30m)
*** GNU Emacs bug triaging
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       OPS.1545721236
    :TASKID:   OPS.1545721236
    :END:
    - [ ] Learn to install particular version of GNU Emacs
    - [ ] Triage 5 bugs
** nightwarrior-xxx
*** DONE freeCodeCamp: Javascript Algorithms and Data Structures  [3/3]
    CLOSED: [2018-12-30 Sun 04:09]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:   5.00
    :OWNER: nightwarrior-xxx
    :ID: READ.1539457208
    :TASKID: READ.1539457208
    :END:  
    :LOGBOOK:
    CLOCK: [2018-12-30 Sun 02:52]--[2018-12-30 Sun 04:08] =>  1:16
    CLOCK: [2018-12-29 Sat 15:16]--[2018-12-29 Sat 16:05] =>  0:49
    CLOCK: [2018-12-28 Fri 01:43]--[2018-12-28 Fri 02:11] =>  0:28
    CLOCK: [2018-12-28 Fri 00:16]--[2018-12-28 Fri 01:43] =>  1:27
    CLOCK: [2018-12-27 Thu 20:32]--[2018-12-27 Thu 21:10] =>  0:38
    CLOCK: [2018-12-27 Thu 19:11]--[2018-12-27 Thu 19:33] =>  0:22
    :END:
    - [X] Basic JavaScript                                                                            (2h)
          [[https://learn.freecodecamp.org/javascript-algorithms-and-data-structures/basic-javascript]]   
    - [X] ES6					                                                                                (4h)
          [[https://learn.freecodecamp.org/javascript-algorithms-and-data-structures/es6]]
    - [X] Regular Expressions		                                                                      (4h)
          [[https://learn.freecodecamp.org/javascript-algorithms-and-data-structures/regular-expressions]]
*** TODO Linux Kernel Module Programming Guide
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1545856561
    :TASKID: READ.1545856561
    :END:
    http://www.tldp.org/LDP/lkmpg/2.6/lkmpg.pdf  (3h)
*** IN_PROGRESS Standard Template Library
    :PROPERTIES:
    :ESTIMATED: 1.5
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1545856251
    :TASKID: READ.1545856251
    :END:
*** TODO Euler Project Challenges [0/0]
    :PROPERTIES:
    :ESTIMATED: 1.5
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1545903248
    :TASKID: READ.1545903248
    :END:
    [[https://www.hackerrank.com/contests/projecteuler/challenges]]
    - [ ] Multiples of 3 and 5	  (0.5h)
    - [ ] Even Fibonacci numbers  (0.5h)
    - [ ] Largest prime factor	  (0.5h)
*** TODO Blog
    :PROPERTIES:
   :ESTIMATED: 1.0
   :ACTUAL:
   :OWNER: nightwarrior-xxx
   :ID: WRITE.1545909518
   :TASKID: WRITE.1545909518
   :END:
    Write a blog and make nightwarrior-xxx.github.io.  
** sandeepK
*** DONE [[https://www.shellscript.sh][Shell Scripting Tutorial]] [12/12]
      :PROPERTIES:
      :ESTIMATED: 7
      :ACTUAL:
      :OWNER: sandeepk
      :ID: read.1545506880
      :TASKID: read.1545506880
      :END:
      :LOGBOOK:
      CLOCK: [2018-12-31 Mon 19:20]--[2018-12-31 Mon 20:00] =>  0:40
      CLOCK: [2018-12-30 Sun 23:00]--[2018-12-30 Sun 23:40] =>  0:40
      CLOCK: [2018-12-30 Sun 20:30]--[2018-12-30 Sun 21:40] =>  1:10
      CLOCK: [2018-12-27 Thu 23:00]--[2018-12-28 Fri 00:00] =>  1:00
      CLOCK: [2018-12-25 Tue 23:00]--[2018-12-26 Wed 00:00] =>  1:00
      CLOCK: [2018-12-24 Mon 19:30]--[2018-12-24 Mon 20:30] =>  1:00
      :END:
    - [X] Revise Chatper 1, 2, 3, 4, 5 (1.3h)
    - [X] Chapter 6 Escape Characters (30m)
    - [X] Chapter 7 Loops (30m)
    - [X] Chapter 8 Test (30m)
    - [X] Chapter 9 Case (30m)
    - [X] Chapter 10 Variable(Part2) (30m)
    - [X] Chapter 11 Variable(Part3) (30m)
    - [X] Chapter 12 External Programs (30m)
    - [X] Chapter 13 Functions (30m)
    - [X] Chapter 14 Hints and Tips (30m)
    - [X] Chapter 15 Quick reference (30m)
    - [X] Chapter 16 Interactive Shell (30m)

*** TODO [[https://www.shellscript.sh/exercises.html][Shell Script Exercise]] [0/2]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:
   :OWNER: sandeepk
   :ID: dev.1545507526
   :TASKID: dev.1545507526
   :END:
   - [ ] Address Book (4h)
   - [ ] Directory Traversal (2h)

*** Blog Post [0/5]
    :PROPERTIES:
    :ESTIMATED: 3.4
    :ACTUAL:
    :OWNER: sandeepk
    :ID: read.1545507998
    :TASKID: read.1545507998
    :END:
    - [ ] [[https://www.nytimes.com/2018/12/17/science/donald-knuth-computers-algorithms-programming.html][The Yoda of Silicon Valley]] (40m)
    - [ ] [[https://www.tubefilter.com/2016/06/23/reverse-engineering-youtube-algorithm/][Reverse Engineering The YouTube alog]] (1h)
    - [ ] [[https://www.interaction-design.org/literature/article/elaboration-likelihood-model-theory-using-elm-to-get-inside-the-user-s-mind][Elaboration Likehood Model Theory]] (1h)
    - [ ] [[https://hackernoon.com/i-finally-understand-static-vs-dynamic-typing-and-you-will-too-ad0c2bd0acc7][Static vs. Dynamic]] (20m)
    - [ ] [[https://www.b-list.org/weblog/2018/nov/26/case/][Truths programmers should know about case]] (40m)
** sidntrivedi012
*** Freecodecamp Javascript Algorithms and Data Structures [0/4]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER:    sidntrivedi
    :ID:       DEV.1538995712
    :TASKID:   DEV.1538995712
    :END:      
    - [ ] Debugging						()
    - [ ] Basic Data Structures			                ()
    - [ ] Basic Algorithm Scripting				()
    - [ ] Object Oriented Programming				()
*** [[https://www.hackerearth.com/practice/codemonk/][HackerEarth Codemonk Series]] [0/1]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: READ.1539000246
    :TASKID: READ.1539000246
    :END:      
    - [ ] Standard Template Library 
*** [#A] Linux for you and me [2/11]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: READ.1538996950
    :TASKID: READ.1538996950
    :END:
    - [ ] Useful Commands	()
    - [ ] Users and groups	()
*** Blog
    [[www.sidntrivedi012.github.io]]
    :PROPERTIES:
    :ESTIMATED: 1 
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: WRITE.1539072660
    :TASKID: WRITE.1539072660
    :END:      
    - [ ] Write one blog.

